In [17]:
import numpy as np

In [18]:
import pandas as pd

In [19]:
import seaborn as sns

In [20]:
ti= sns.load_dataset('titanic')[['age','pclass','sibsp','parch','survived']]

In [21]:
ti.head(2)

    age  pclass  sibsp  parch  survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1

In [22]:
ti.dropna(inplace=True)

In [23]:
ti.head(2)

    age  pclass  sibsp  parch  survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1

In [24]:
a = ti.iloc[:,0:4]
b = ti.iloc[:,-1]

In [25]:
a

      age  pclass  sibsp  parch
0    22.0       3      1      0
1    38.0       1      1      0
2    26.0       3      0      0
3    35.0       1      1      0
4    35.0       3      0      0
..    ...     ...    ...    ...
885  39.0       3      0      5
886  27.0       2      0      0
887  19.0       1      0      0
889  26.0       1      0      0
890  32.0       3      0      0

[714 rows x 4 columns]

In [26]:
from sklearn .model_selection import cross_val_score

In [27]:
from sklearn .linear_model import LogisticRegression

In [28]:
np.mean(cross_val_score(LogisticRegression(),a,b,scoring='accuracy',cv=20))

0.6933333333333332

# applying feature construction

In [30]:
a['family_size'] = a['sibsp']+a['parch']+1

In [31]:
a.head(3)

    age  pclass  sibsp  parch  family_size
0  22.0       3      1      0            2
1  38.0       1      1      0            2
2  26.0       3      0      0            1

In [32]:
def myfunc (num):
    if num == 1:
        return 0
    elif num>1 and num<=4:
        return 1
    else:
        return 2

In [33]:
myfunc(4)

1

In [34]:
a['family_type'] = a['family_size'].apply(myfunc)

In [35]:
a.head(2)

    age  pclass  sibsp  parch  family_size  family_type
0  22.0       3      1      0            2            1
1  38.0       1      1      0            2            1

In [36]:
a.drop(columns=['sibsp','parch','family_size'],inplace=True)

In [37]:
a.head(4)

    age  pclass  family_type
0  22.0       3            1
1  38.0       1            1
2  26.0       3            0
3  35.0       1            1

In [38]:
np.mean(cross_val_score(LogisticRegression(),a,b,scoring='accuracy',cv=20))

0.7003174603174602